Can't make cut-out.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCreateCutoutWarn { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCreateCutoutWarn As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCreateCutoutWarn {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CreationFailures Class
  Autodesk.Revit.DB Namespace